clf                              %清除当前窗口中的图形
x=0:0.1:5;y=x;                   %确定自变量的取值范围和采样间隔
[X,Y]=meshgrid(x);               %生成x-y平面上的自变量“格点”矩阵
Z=X.^2+Y.^2;                     %计算格点上的函数值

subplot(1,2,1)                   %使窗口左侧子图为当前图
mesh(X,Y,Z)                      %绘制三维网格图
title('三维网格图z=x^{2}+y^{2}')  %为网格图添加标题
axis([0,6,0,6,0,60])             %设定坐标轴范围

subplot(1,2,2)                   %使窗口右侧子图为当前图
surf(X,Y,Z)                      %绘制三维曲面图
title('三维曲面图z=x^{2}+y^{2}')  %为曲面图添加标题
axis([0,6,0,6,0,60])             %设定坐标轴范围

shading interp                   %对三维曲面图采用插补明暗处理
